<x-layouts.app>
    <x-slot:title>О нас</x-slot:title>
    <x-slot:header>О нас</x-slot:header>

    <x-html.p>Это приложение представляет собой платформу для просмотра и управления вакансиями, предназначенную для пользователей и администраторов (представителей компаний).</x-html.p>

    <x-html.h2>Основные возможности приложения:</x-html.h2>

    <x-html.h3>Для пользователей:</x-html.h3>

    <x-html.ul>
        <li class="mb-2">Регистрация и авторизация: простая регистрация с возможностью авторизации для доступа к полному функционалу приложения.</li>
        <li class="mb-2">Просмотр вакансий: доступ ко всем вакансиям с возможностью использовать умный фильтр и поиск для быстрого нахождения подходящих позиций.</li>
        <li class="mb-2">Отклик на вакансии: возможность откликаться на интересующие вакансии и сохранять их в разделе "Понравившиеся вакансии".</li>
        <li class="mb-2">Управление профилем: редактирование личной информации, смена пароля и электронной почты, удаление аккаунта.</li>
        <li class="mb-2">Информация о компаниях: просмотр страниц компаний с детальной информацией о них.</li>
    </x-html.ul>

    <x-html.h3>Для администраторов:</x-html.h3>

    <x-html.ul>
        <li class="mb-2">Регистрация администратора: специальная форма регистрации для представителей компаний с дополнительными возможностями.</li>
        <li class="mb-2">Управление вакансиями: создание, редактирование и удаление вакансий, просмотр списка всех опубликованных вакансий.</li>
        <li class="mb-2">Информация о компании: редактирование данных о компании, генерация ключа для дополнительных настроек.</li>
        <li class="mb-2">Просмотр откликов: доступ к списку соискателей, откликнувшихся на вакансии, для дальнейшего взаимодействия.</li>
    </x-html.ul>

    <x-html.p>
        Это приложение обеспечивает эффективное взаимодействие между соискателями и работодателями, упрощая процесс поиска работы и подбора персонала.
        Удобный интерфейс и широкий функционал позволяют пользователям легко находить интересующие вакансии,
        а администраторам эффективно управлять предложениями и взаимодействовать с потенциальными сотрудниками.
    </x-html.p>

</x-layouts.app>